content/main/20211022221443-drawing_machine.md
+++
title = "Drawing Machine"
author = ["System Administrator"]
draft = false
+++

## Flow {#flow}


### 1. Line Art {#1-dot-line-art}

[Lineart Machine]({{< relref "20211023144531-lineart_machine.md" >}})


#### 1. Rhythm Line {#1-dot-rhythm-line}

The line abstracting the body into impression of lines

<!--list-separator-->

-  The Rate

    head = 1 he
    body = 1.5 he
    butt = 1 he
    leg = 1.5 he + 1.5 he
    palm = 1 he + 1 he + 2/3 he(hand)


#### 2. Shape {#2-dot-shape}

impression of shape

<!--list-separator-->

-  Shapes

    -   Head = Square + Triangel
    -   Body = Square
    -   Butt = Square + Triangle(wider than head)
    -   Leg:
        -   upper = straight 1 side, middle out other side
        -   downner = strat 1 side, up out other side
    -   Palm: same as leg


#### 3. Space {#3-dot-space}

3-d. Give it some space


### 2. Color {#2-dot-color}


#### 1. Origin {#1-dot-origin}


#### 2. Light {#2-dot-light}


#### 3. Shadow {#3-dot-shadow}


## Principles {#principles}


### The Shape = boarder line + shades {#the-shape-boarder-line-plus-shades}

-   Boarder line
    -   Draw Only the boarder line, when it cames to boarder.
        The left, The Right boarder, Things that could be seen, and that's it.
        Imagine the light goes in the front, and only the light's covering is drawn with boarder lines.
        Or in the other way, only the boarder of the shadow.
    -   Boarder line is where the eyes `see no more`. `The shape ends there`. The edges, up, down, left, right. But not front
    -   The Front, the waves you illustrate with `shades`